/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "0";
"version-sig"	= "EN-070918";

"common-controls-restart"		= "Restart";
"common-controls-shutdown"		= "Shut Down";
"common-controls-continue"		= "Continue";

"common-tab-apple-title"		= " About ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Hardware Tests ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Hardware Profile ";	// does look better with spaces at head and tail
"common-version-str"			= "Version ";
"common-bundle-str"				= "Bundle ";

"mark-graphics-unknown-str"		= "Unknown video";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Installed";
"mark-generic-absent-str"		= "Not Found";
"mark-generic-hasDevice-str"	= "Device connected";
"mark-generic-hasNoDevice-str"	= "No device connected";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "Hertz";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "Byte";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bit";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "Volt";


"units-hour-str"		= " hour ";
"units-hours-str"		= " hours ";
"units-min-str"			= " min ";
"units-mins-str"		= " mins ";
"units-sec-str"			= " sec";
"units-secs-str"		= " secs";

"units-kilo-str"		= "K";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ".";
"delim-thousds-str"		= ", ";
"delim-space-str"		= " ";
"delim-pct-str"			= "%";

"notcompat-nosupport-str"		= "Apple Hardware Test does not support this machine.";
"notcompat-ownrisk-str"			= "Continue at your own risk [pre-release only].";


"test-head-intro1-text"			= "Apple Hardware Test can perform hardware testing of your Macintosh.";
"test-head-intro2-text"			= "To perform the tests, click on the “Test” button or press the “T” key.";

"test-probe-onto-text"			= "Probing your hardware; this may take a minute...";
"test-probe-outof-text"			= "Hardware probe complete.";

"test-controls-launch"			= "Test";
"test-controls-interrupt"		= "Stop Testing";

"test-choices-title"			= "Test Choices";
"test-about-title"				= "About the Tests and Results";
"test-results-title"			= "Test Results";

"test-results-notestyet"		= "No test can be run until probe is completed.";
"test-results-nodevfound"		= "No devices were found.";
"test-results-notyet"			= "Ready for testing.";
"test-results-quick-ongoing"	= "Testing in progress.";
"test-results-extend-ongoing"	= "Extended testing in progress.";
"test-results-willstop"			= "Testing will stop.";
"test-results-interrupted"		= "Testing was not completed.";
"test-results-nofail"			= "No trouble found.";
"test-results-error"			= "Internal error during test.";
"test-results-failed"			= "Alert!  Apple Hardware Test has detected an error.";

"test-ongoing-short-status"		= "Testing in progress.";
"test-ongoing-mlb-status"		= "Testing main logic board.";
"test-ongoing-memory-status"	= "Testing memory.";
"test-ongoing-storage-status"	= "Testing storage.";
"test-ongoing-video-status"		= "Testing graphics.";

"test-ongoing-pass-time-text"	= " into testing...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "into testing...";
"test-ongoing-sess-pass-text"	= "Pass Number: ";
"test-ongoing-sess-time-text"	= "Total Time Testing: ";

"test-desc-initial-1-text"	= "Apple Hardware Test is a diagnostic tool for detecting problems with your computer's hardware components.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "The tests performed will help determine if you have a hardware problem or a software problem.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "If the test results determine that a hardware problem does not exist, consult the manual and/or Help (system) that came with your computer for further troubleshooting.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Estimated time to complete: 3 minutes or longer, depending on the amount of memory installed.";	/* default */
"test-desc-intro-quick-text2"	= "Estimated time to complete: 10 to 15 seconds or longer, depending on the amount of memory installed.";
"test-desc-intro-quick-text3"	= "Estimated time to complete: 2 minutes or longer, depending on the amount of memory installed.";
"test-desc-intro-quick-text4"	= "Estimated time to complete: 4 minutes or longer, depending on the amount of memory installed.";

"test-desc-intro-extend-text"	= "Estimated time to complete: 1 hour or longer, depending on the amount of memory installed.";	/* default */
"test-desc-intro-extend-text2"	= "Estimated time to complete: 10 to 15 minutes or longer, depending on the amount of memory installed.";
"test-desc-intro-extend-text3"	= "Estimated time to complete: 30 minutes or longer depending, on the amount of memory installed.";
"test-desc-intro-extend-text4"	= "Estimated time to complete: 2 hours or longer, depending on the amount of memory installed.";

"test-desc-option-extend-text"	= "Perform extended testing (takes considerably more time).";
"test-desc-option-loop-text"	= "Looping enabled.";

"test-desc-quick-running-1-text"	= "Testing in progress...";
"test-desc-quick-running-2-text"	= "To stop, click the “Stop Testing” button.";
"test-desc-quick-running-3-text"	= "Or, press the “command” (“Apple”) key and the “.” (period) key at the same time.";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Extended Testing in progress...";
"test-desc-extend-running-2-text"	= "To stop, click the “Stop Testing” button.";
"test-desc-extend-running-3-text"	= "Or, press the “command” (“Apple”) key and the “.” (period) key at the same time.";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Alert!  Apple Hardware Test has detected an error.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "First, make a note of the Error Code in the Test Results area.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Second, if there are any peripherals attached to the computer, please shut down the computer, disconnect the peripherals and run the Extended Test to verify the results.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Next, if an error is still reported, review the service and support material that accompanied your computer for instructions on contacting AppleCare for further assistance.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Alert!  Apple Hardware Test has detected an error at startup.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "First, make a note of the Error Codes in the Test Results area.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Second, if there are any peripherals attached to the computer, please shut down the computer, disconnect the peripherals and run the Extended Test to verify the results.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Next, if an error is still reported, review the service and support material that accompanied your computer for instructions on contacting AppleCare for further assistance.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Product";
"prof-prod-group-subtitle"		= "Product details:";
"prof-prod-name-label"			= "Macintosh name:";
"prof-prod-model-label"			= "Macintosh model:";
"prof-prod-cputype-label"		= "CPU Type:";
"prof-prod-cpucount-label"		= "Number Of Processors:";
"prof-prod-cpucoretotal-label"	= "Total Number Of Cores:";
"prof-prod-cpucorecount-label"	= "Number Of Cores:";
"prof-prod-cpuspeed-label"		= "CPU Speed:";
"prof-prod-cpucache-label"		= "L2 CPU Cache (per processor):";

"prof-prod-L2cache-label"		= "L2 Cache:";
"prof-prod-L2cachecore-label"	= "L2 Cache (per core):";
"prof-prod-L3cache-label"		= "L3 Cache:";

"prof-prod-cpucache3-label"		= "L3 CPU Cache (per CPU):";
"prof-prod-mlb-sn-label"		= "MLB serial#:";
"prof-processor-tray-sn-label"	= "Processor Tray serial#:";

"prof-graph-group-title"		= "Video";
"prof-graph-group-subtitle"		= "Video details:";
"prof-graph-chipset-label"		= "Graphics:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Display width (pixels):";
"prof-graph-disp-height-label"	= "Display height (pixels):";

"prof-communi-group-title"		= "Communication";
"prof-communi-group-subtitle"	= "Communication details:";
"prof-communi-enet-mac-label"	= "Ethernet MAC address:";
"prof-communi-fwire-mac-label"	= "FireWire MAC address:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "IR Receiver:";
"prof-communi-usb1-connect-label"	= "USB Port 1:";
"prof-communi-usb2-connect-label"	= "USB Port 2:";
"prof-communi-usb3-connect-label"	= "USB Port 3:";
"prof-communi-usb4-connect-label"	= "USB Port 4:";

"prof-memo-group-title"			= "Memory";
"prof-memo-group-subtitle"		= "Memory details:";
"prof-memo-overview-label"		= "Overview";
"prof-memo-slot-1-label"		= "Memory #1";
"prof-memo-slot-2-label"		= "Memory #2";
"prof-memo-slot-3-label"		= "Memory #3";
"prof-memo-slot-4-label"		= "Memory #4";
"prof-memo-slot-5-label"		= "Memory #5";
"prof-memo-slot-6-label"		= "Memory #6";
"prof-memo-slot-7-label"		= "Memory #7";
"prof-memo-slot-8-label"		= "Memory #8";

"prof-memo-type-str"			= "MLB soldered SDRAM.";
"prof-memo--str"				= "Unknown";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Cycle time (ns)";
"prof-memo-ct2-str"				= " Cycle (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "Paired with #";
"prof-memo-paired-not-str"		= " not paired";
"prof-memo-mismatch-label"		= "Mismatch:";
"prof-memo-size-str"			= " size";
"prof-memo-speed-str"			= " speed";
"prof-memo-vendor-str"			= " vendor";
"prof-memo-recommend-str"		= "Recommended: ";
"prof-memo-post-fail-str"		= "POST failure";

"prof-board-group-title"		= "Logic Board";
"prof-board-brom-vers-label"	= "Boot ROM version:";
"prof-board-smc-vers-label"		= "SMC version:";
"prof-board-syst-sn-label"		= "System serial #:";
"prof-board-bootdev-label"		= "Default boot device:";

"prof-stor-group-title"			= "Storage";
"prof-stor-size-label"			= "Size:";

"prof-powr-group-title"			= "Power";
"prof-powr-group-subtitle"		= "Power details:";
"prof-powr-src-label"			= "Power source:";
"prof-powr-src-wall-str"		= "Adapter";
"prof-powr-src-batt-str"		= "Battery";
"prof-powr-ac-on-str"			= "Connected";
"prof-powr-ac-off-str"			= "Not connected";
"prof-powr-capac-label"			= "Capacity:";
"prof-powr-volt-label"			= "Voltage:";
"prof-powr-status-label"		= "Status:";

